thingworx-test/report/Server1/report/statistics.json
{
  "Test3:HTTP Request 1M String" : {
    "transaction" : "Test3:HTTP Request 1M String",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 568.0,
    "medianResTime" : 568.0,
    "minResTime" : 568.0,
    "maxResTime" : 568.0,
    "pct1ResTime" : 568.0,
    "pct2ResTime" : 568.0,
    "pct3ResTime" : 568.0,
    "throughput" : 1.7605633802816902,
    "receivedKBytesPerSec" : 1805.5849746919016,
    "sentKBytesPerSec" : 0.579404159330986
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 5,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1229.6,
    "medianResTime" : 578.0,
    "minResTime" : 437.0,
    "maxResTime" : 3963.0,
    "pct1ResTime" : 3963.0,
    "pct2ResTime" : 3963.0,
    "pct3ResTime" : 3963.0,
    "throughput" : 0.8119519324455993,
    "receivedKBytesPerSec" : 1096.8568262321369,
    "sentKBytesPerSec" : 0.26784898708996424
  },
  "Test0:HTTP Request 1k String" : {
    "transaction" : "Test0:HTTP Request 1k String",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 437.0,
    "medianResTime" : 437.0,
    "minResTime" : 437.0,
    "maxResTime" : 437.0,
    "pct1ResTime" : 437.0,
    "pct2ResTime" : 437.0,
    "pct3ResTime" : 437.0,
    "throughput" : 2.288329519450801,
    "receivedKBytesPerSec" : 3.6000965389016018,
    "sentKBytesPerSec" : 0.7530928203661327
  },
  "Test1:HTTP Request 100k String" : {
    "transaction" : "Test1:HTTP Request 100k String",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 602.0,
    "medianResTime" : 602.0,
    "minResTime" : 602.0,
    "maxResTime" : 602.0,
    "pct1ResTime" : 602.0,
    "pct2ResTime" : 602.0,
    "pct3ResTime" : 602.0,
    "throughput" : 1.6611295681063123,
    "receivedKBytesPerSec" : 167.22253945182726,
    "sentKBytesPerSec" : 0.5499247300664452
  },
  "Test2:HTTP Request 500k String" : {
    "transaction" : "Test2:HTTP Request 500k String",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 578.0,
    "medianResTime" : 578.0,
    "minResTime" : 578.0,
    "maxResTime" : 578.0,
    "pct1ResTime" : 578.0,
    "pct2ResTime" : 578.0,
    "pct3ResTime" : 578.0,
    "throughput" : 1.7301038062283738,
    "receivedKBytesPerSec" : 866.8833801903115,
    "sentKBytesPerSec" : 0.5727589749134948
  },
  "Test4:HTTP Request 5M String" : {
    "transaction" : "Test4:HTTP Request 5M String",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 3963.0,
    "medianResTime" : 3963.0,
    "minResTime" : 3963.0,
    "maxResTime" : 3963.0,
    "pct1ResTime" : 3963.0,
    "pct2ResTime" : 3963.0,
    "pct3ResTime" : 3963.0,
    "throughput" : 0.25233409033560433,
    "receivedKBytesPerSec" : 1293.356615095887,
    "sentKBytesPerSec" : 0.08304354340146354
  }
}