thingworx-test/report/Server1/thingworx-jmeter-Server1.log
2020-10-25 16:36:06,263 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Loading user properties from: user.properties
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Loading system properties from: system.properties
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Setting JMeter property: TARGET_HOST=hpmc-thingworx.westeurope.cloudapp.azure.com
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PORT=8443
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Setting JMeter property: TARGET_APPKEY=826664a3-2c46-4139-89de-a4a13d56c271
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Setting JMeter property: THREADS=1
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Setting JMeter property: SCHEME=http
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Copyright (c) 1998-2020 The Apache Software Foundation
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Version 5.3
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: java.version=1.8.0_265
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: os.name=Windows Server 2019
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: os.arch=amd64
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: os.version=10.0
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: file.encoding=Cp1252
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: java.awt.headless=true
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Max memory     =1073741824
2020-10-25 16:36:06,295 INFO o.a.j.JMeter: Available Processors =2
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.3\apache-jmeter-5.3
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: user.dir  =C:\apache-jmeter-5.3\apache-jmeter-5.3\bin
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: PWD       =C:\apache-jmeter-5.3\apache-jmeter-5.3\bin
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: IP: 172.28.76.100 Name: e1546bd4c6c7 FullName: e1546bd4c6c7
2020-10-25 16:36:06,310 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report'
2020-10-25 16:36:06,326 INFO o.a.j.s.FileServer: Default base='C:\apache-jmeter-5.3\apache-jmeter-5.3\bin'
2020-10-25 16:36:06,326 INFO o.a.j.s.FileServer: Set new base='C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test'
2020-10-25 16:36:06,498 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-10-25 16:36:06,529 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-10-25 16:36:06,529 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-10-25 16:36:06,545 INFO o.a.j.s.SaveService: Loading file: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\thingworx-test.jmx
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-10-25 16:36:06,591 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-10-25 16:36:06,638 INFO o.a.j.JMeter: Creating summariser <summary>
2020-10-25 16:36:06,654 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-10-25 16:36:06,654 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\thingworx-test-Server1.csv
2020-10-25 16:36:06,654 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\reportgenerator.properties
2020-10-25 16:36:06,654 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-10-25 16:36:06,654 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-10-25 16:36:06,670 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-10-25 16:36:06,685 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-10-25 16:36:06,685 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-10-25 16:36:06,685 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-10-25 16:36:06,685 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-10-25 16:36:06,685 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-10-25 16:36:06,685 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-10-25 16:36:06,685 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-10-25 16:36:06,685 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-10-25 16:36:06,685 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-10-25 16:36:07,029 INFO o.a.j.JMeter: Running test (1603618567029)
2020-10-25 16:36:07,060 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Scenario1
2020-10-25 16:36:07,060 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Scenario1.
2020-10-25 16:36:07,060 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-10-25 16:36:07,060 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-10-25 16:36:07,060 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-10-25 16:36:07,060 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-10-25 16:36:07,060 INFO o.a.j.t.JMeterThread: Thread started: Scenario1 1-1
2020-10-25 16:36:07,091 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = e1546bd4c6c7
2020-10-25 16:36:07,107 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-10-25 16:36:07,107 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-10-25 16:36:07,107 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-10-25 16:36:07,107 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-10-25 16:36:07,107 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-10-25 16:36:13,342 INFO o.a.j.t.JMeterThread: Thread is done: Scenario1 1-1
2020-10-25 16:36:13,342 INFO o.a.j.t.JMeterThread: Thread finished: Scenario1 1-1
2020-10-25 16:36:13,357 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-10-25 16:36:13,357 INFO o.a.j.r.Summariser: summary =      5 in 00:00:06 =    0.8/s Avg:  1229 Min:   437 Max:  3963 Err:     0 (0.00%)
2020-10-25 16:36:13,357 INFO o.a.j.JMeter: Generating Dashboard
2020-10-25 16:36:13,357 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-10-25 16:36:13,373 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-10-25 16:36:13,498 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-10-25 16:36:13,498 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-10-25 16:36:13,498 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-10-25 16:36:13,498 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-10-25 16:36:13,513 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-10-25 16:36:13,513 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-10-25 16:36:13,513 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-10-25 16:36:13,513 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 35 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-10-25 16:36:13,529 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-10-25 16:36:13,545 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 75 samples
2020-10-25 16:36:13,545 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 15 samples
2020-10-25 16:36:13,545 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 5 samples
2020-10-25 16:36:13,545 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 5 samples produced in 141ms on channel 0
2020-10-25 16:36:13,545 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-10-25 16:36:13,545 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-10-25 16:36:13,545 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-10-25 16:36:13,545 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-10-25 16:36:13,545 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-10-25 16:36:13,545 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report\statistics.json
2020-10-25 16:36:13,701 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-10-25 16:36:13,701 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report
2020-10-25 16:36:13,857 ERROR f.configuration: DefaultObjectWrapper.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-10-25 16:36:13,857 ERROR f.configuration: Configuration.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-10-25 16:36:13,873 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report, creating folder structure
2020-10-25 16:36:13,873 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\report-template' to 'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report', got message: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report, found non empty folder with following content [C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server1\report\statistics.json], will be ignored
2020-10-25 16:36:14,858 INFO o.a.j.JMeter: Dashboard generated