thingworx-test/report/Server2/thingworx-jmeter-Server2.log
2020-10-25 16:36:23,180 INFO o.a.j.u.JMeterUtils: Setting Locale to en_EN
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Loading user properties from: user.properties
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Loading system properties from: system.properties
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Setting JMeter property: TARGET_HOST=hpmc-thingworx.azurefd.net
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Setting JMeter property: TARGET_PORT=443
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Setting JMeter property: TARGET_APPKEY=826664a3-2c46-4139-89de-a4a13d56c271
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Setting JMeter property: THREADS=1
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Setting JMeter property: SCHEME=https
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Copyright (c) 1998-2020 The Apache Software Foundation
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: Version 5.3
2020-10-25 16:36:23,196 INFO o.a.j.JMeter: java.version=1.8.0_265
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: java.vm.name=OpenJDK 64-Bit Server VM
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: os.name=Windows Server 2019
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: os.arch=amd64
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: os.version=10.0
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: file.encoding=Cp1252
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: java.awt.headless=true
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: Max memory     =1073741824
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: Available Processors =2
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: Default Locale=English (EN)
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: JMeter  Locale=English (EN)
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: JMeterHome=C:\apache-jmeter-5.3\apache-jmeter-5.3
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: user.dir  =C:\apache-jmeter-5.3\apache-jmeter-5.3\bin
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: PWD       =C:\apache-jmeter-5.3\apache-jmeter-5.3\bin
2020-10-25 16:36:23,212 INFO o.a.j.JMeter: IP: 172.28.75.239 Name: 22ef9fd783cb FullName: 22ef9fd783cb
2020-10-25 16:36:23,227 INFO o.a.j.JMeter: Setting property 'jmeter.reportgenerator.outputdir' to:'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report'
2020-10-25 16:36:23,227 INFO o.a.j.s.FileServer: Default base='C:\apache-jmeter-5.3\apache-jmeter-5.3\bin'
2020-10-25 16:36:23,243 INFO o.a.j.s.FileServer: Set new base='C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test'
2020-10-25 16:36:23,384 INFO o.a.j.s.SaveService: Testplan (JMX) version: 2.2. Testlog (JTL) version: 2.2
2020-10-25 16:36:23,430 INFO o.a.j.s.SaveService: Using SaveService properties file encoding UTF-8
2020-10-25 16:36:23,430 INFO o.a.j.s.SaveService: Using SaveService properties version 5.0
2020-10-25 16:36:23,430 INFO o.a.j.s.SaveService: Loading file: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\thingworx-test.jmx
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/html is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xhtml+xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for application/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/xml is org.apache.jmeter.protocol.http.parser.LagartoBasedHtmlParser
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/vnd.wap.wml is org.apache.jmeter.protocol.http.parser.RegexpHTMLParser
2020-10-25 16:36:23,493 INFO o.a.j.p.h.s.HTTPSamplerBase: Parser for text/css is org.apache.jmeter.protocol.http.parser.CssParser
2020-10-25 16:36:23,524 INFO o.a.j.JMeter: Creating summariser <summary>
2020-10-25 16:36:23,524 INFO o.a.j.r.d.ReportGenerator: ReportGenerator will use for Parsing the separator: ','
2020-10-25 16:36:23,540 INFO o.a.j.r.d.ReportGenerator: Will generate report at end of test from  results file: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\thingworx-test-Server2.csv
2020-10-25 16:36:23,540 INFO o.a.j.r.d.ReportGenerator: Reading report generator properties from: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\reportgenerator.properties
2020-10-25 16:36:23,540 INFO o.a.j.r.d.ReportGenerator: Merging with JMeter properties
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.temp_dir' not found, using default value 'temp' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.apdex_per_transaction' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: apdex_per_transaction is empty, not APDEX per transaction customization
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.sample_filter' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.report_title' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.start_date' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.end_date' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.date_format' not found, using default value 'null' instead.
2020-10-25 16:36:23,540 INFO o.a.j.r.c.ReportGeneratorConfiguration: Will use date range start date: null, end date: null
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.totalTPS.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.activeThreadsOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.timeVsThreads.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimeDistribution.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.transactionsPerSecond.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentiles.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimePercentilesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.responseTimesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.connectTimeOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.graph.latenciesOverTime.exclude_controllers' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.filters_only_sample_series' not found, using default value 'true' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.series_filter' not found, using default value '' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.json.show_controllers_only' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.filters_only_sample_series' not found, using default value 'true' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.series_filter' not found, using default value '' instead.
2020-10-25 16:36:23,555 INFO o.a.j.r.c.ReportGeneratorConfiguration: Property 'jmeter.reportgenerator.exporter.html.show_controllers_only' not found, using default value 'false' instead.
2020-10-25 16:36:23,555 INFO o.a.j.e.StandardJMeterEngine: Running the test!
2020-10-25 16:36:23,571 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-10-25 16:36:23,571 INFO o.a.j.s.SampleEvent: List of sample_variables: []
2020-10-25 16:36:23,571 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must contain the string: '.functions.'
2020-10-25 16:36:23,571 INFO o.a.j.e.u.CompoundVariable: Note: Function class names must not contain the string: '.gui.'
2020-10-25 16:36:23,915 INFO o.a.j.JMeter: Running test (1603618583915)
2020-10-25 16:36:23,946 INFO o.a.j.e.StandardJMeterEngine: Starting ThreadGroup: 1 : Scenario1
2020-10-25 16:36:23,946 INFO o.a.j.e.StandardJMeterEngine: Starting 1 threads for group Scenario1.
2020-10-25 16:36:23,946 INFO o.a.j.e.StandardJMeterEngine: Thread will continue on error
2020-10-25 16:36:23,946 INFO o.a.j.t.ThreadGroup: Starting thread group... number=1 threads=1 ramp-up=1 delayedStart=false
2020-10-25 16:36:23,946 INFO o.a.j.t.ThreadGroup: Started thread group number 1
2020-10-25 16:36:23,946 INFO o.a.j.e.StandardJMeterEngine: All thread groups have been started
2020-10-25 16:36:23,946 INFO o.a.j.t.JMeterThread: Thread started: Scenario1 1-1
2020-10-25 16:36:23,993 INFO o.a.j.p.h.s.HTTPHCAbstractImpl: Local host = 22ef9fd783cb
2020-10-25 16:36:23,993 INFO o.a.j.p.h.s.HTTPHC4Impl: HTTP request retry count = 0
2020-10-25 16:36:23,993 INFO o.a.j.s.SampleResult: Note: Sample TimeStamps are START times
2020-10-25 16:36:23,993 INFO o.a.j.s.SampleResult: sampleresult.default.encoding is set to ISO-8859-1
2020-10-25 16:36:23,993 INFO o.a.j.s.SampleResult: sampleresult.useNanoTime=true
2020-10-25 16:36:23,993 INFO o.a.j.s.SampleResult: sampleresult.nanoThreadSleep=5000
2020-10-25 16:36:24,134 INFO o.a.j.p.h.s.h.LazyLayeredConnectionSocketFactory: Setting up HTTPS TrustAll Socket Factory
2020-10-25 16:36:24,149 INFO o.a.j.u.JsseSSLManager: Using default SSL protocol: TLS
2020-10-25 16:36:24,149 INFO o.a.j.u.JsseSSLManager: SSL session context: per-thread
2020-10-25 16:36:24,243 INFO o.a.j.u.SSLManager: JmeterKeyStore Location:  type JKS
2020-10-25 16:36:24,243 INFO o.a.j.u.SSLManager: KeyStore created OK
2020-10-25 16:36:24,243 WARN o.a.j.u.SSLManager: Keystore file not found, loading empty keystore
2020-10-25 16:36:28,181 INFO o.a.j.t.JMeterThread: Thread is done: Scenario1 1-1
2020-10-25 16:36:28,181 INFO o.a.j.t.JMeterThread: Thread finished: Scenario1 1-1
2020-10-25 16:36:28,181 INFO o.a.j.e.StandardJMeterEngine: Notifying test listeners of end of test
2020-10-25 16:36:28,181 INFO o.a.j.r.Summariser: summary =      5 in 00:00:04 =    1.2/s Avg:   818 Min:   566 Max:  1032 Err:     0 (0.00%)
2020-10-25 16:36:28,181 INFO o.a.j.JMeter: Generating Dashboard
2020-10-25 16:36:28,181 INFO o.a.j.r.d.ReportGenerator: Flushing result collector before report Generation
2020-10-25 16:36:28,196 INFO o.a.j.r.p.NormalizerSampleConsumer: Using format, 'ms', to parse timeStamp field
2020-10-25 16:36:28,274 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): beginDate produced 0 samples
2020-10-25 16:36:28,274 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.AggregateConsumer#stopProducing(): endDate produced 0 samples
2020-10-25 16:36:28,274 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ApdexSummaryConsumer#stopProducing(): apdexSummary produced 0 samples
2020-10-25 16:36:28,274 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.RequestsSummaryConsumer#stopProducing(): requestsSummary produced 0 samples
2020-10-25 16:36:28,274 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.StatisticsSummaryConsumer#stopProducing(): statisticsSummary produced 0 samples
2020-10-25 16:36:28,290 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.Top5ErrorsBySamplerConsumer#stopProducing(): top5ErrorsBySampler produced 0 samples
2020-10-25 16:36:28,290 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.ErrorsSummaryConsumer#stopProducing(): errorsSummary produced 0 samples
2020-10-25 16:36:28,290 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.HitsPerSecondGraphConsumer#stopProducing(): hitsPerSecond produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyVSRequestGraphConsumer#stopProducing(): latencyVsRequest produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.SyntheticResponseTimeDistributionGraphConsumer#stopProducing(): syntheticResponseTimeDistribution produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.BytesThroughputGraphConsumer#stopProducing(): bytesThroughputOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.CodesPerSecondGraphConsumer#stopProducing(): codesPerSecond produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeVSRequestGraphConsumer#stopProducing(): responseTimeVsRequest produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): startIntervalControlerFilter produced 35 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TotalTPSGraphConsumer#stopProducing(): totalTPS produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ActiveThreadsGraphConsumer#stopProducing(): activeThreadsOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TimeVSThreadGraphConsumer#stopProducing(): timeVsThreads produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeDistributionGraphConsumer#stopProducing(): responseTimeDistribution produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.TransactionsPerSecondGraphConsumer#stopProducing(): transactionsPerSecond produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesGraphConsumer#stopProducing(): responseTimePercentiles produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimePercentilesOverTimeGraphConsumer#stopProducing(): responseTimePercentilesOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ResponseTimeOverTimeGraphConsumer#stopProducing(): responseTimesOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.ConnectTimeOverTimeGraphConsumer#stopProducing(): connectTimeOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.graph.impl.LatencyOverTimeGraphConsumer#stopProducing(): latenciesOverTime produced 0 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): nameFilter produced 75 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.FilterConsumer#stopProducing(): dateRangeFilter produced 15 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.AbstractSampleConsumer: class org.apache.jmeter.report.processor.NormalizerSampleConsumer#stopProducing(): normalizer produced 5 samples
2020-10-25 16:36:28,306 INFO o.a.j.r.p.CsvFileSampleSource: produce(): 5 samples produced in 63ms on channel 0
2020-10-25 16:36:28,321 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'json' of className:'org.apache.jmeter.report.dashboard.JsonExporter'
2020-10-25 16:36:28,321 INFO o.a.j.r.d.JsonExporter: Found data for consumer statisticsSummary in context
2020-10-25 16:36:28,321 INFO o.a.j.r.d.JsonExporter: Creating statistics for overall
2020-10-25 16:36:28,321 INFO o.a.j.r.d.JsonExporter: Creating statistics for other transactions
2020-10-25 16:36:28,321 INFO o.a.j.r.d.JsonExporter: Checking output folder
2020-10-25 16:36:28,321 INFO o.a.j.r.d.JsonExporter: Writing statistics JSON to C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report\statistics.json
2020-10-25 16:36:28,477 INFO o.a.j.r.d.ReportGenerator: Exporting data using exporter:'html' of className:'org.apache.jmeter.report.dashboard.HtmlTemplateExporter'
2020-10-25 16:36:28,493 INFO o.a.j.r.d.HtmlTemplateExporter: Will generate dashboard in folder: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report
2020-10-25 16:36:28,634 ERROR f.configuration: DefaultObjectWrapper.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-10-25 16:36:28,634 ERROR f.configuration: Configuration.incompatibleImprovements was set to the object returned by Configuration.getVersion(). That defeats the purpose of incompatibleImprovements, and makes upgrading FreeMarker a potentially breaking change. Also, this probably won't be allowed starting from 2.4.0. Instead, set incompatibleImprovements to the highest concrete version that's known to be compatible with your application.
2020-10-25 16:36:28,649 INFO o.a.j.r.d.HtmlTemplateExporter: Report will be generated in: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report, creating folder structure
2020-10-25 16:36:28,649 INFO o.a.j.r.d.TemplateVisitor: Copying folder from 'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\report-template' to 'C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report', got message: C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report, found non empty folder with following content [C:\apache-jmeter-5.3\apache-jmeter-5.3\bin\jmeter-tw\thingworx-test\report\Server2\report\statistics.json], will be ignored
2020-10-25 16:36:29,540 INFO o.a.j.JMeter: Dashboard generated